app/controllers/sessions_controller.rb

  def create
  	@email = params[:session][:email]
  	@user = User.find_by(email: @email.downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tru@tru.fr"], ["LIMIT", 1]]