app/controllers/static_pages_controller.rb

  def home
  	@tab_user = User.all
---
SELECT "users".* FROM "users"