app/controllers/users_controller.rb

  def create
  	@user = User.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      email: params[:email],
      password: params[:password],
      password_confirmation: params[:password_confirmation]
      )
  	if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def secret_page
  	@tab_users = User.all
---
SELECT "users".* FROM "users"